package main

import (
	"fmt"
	"siaodMath/slau"
)

func main() {
	fmt.Println(slau.Gaus([][]float64{{5, 0, 1}, {1, 3, -1}, {-3, 2, 10}}, []float64{11, 4, 6}))
	// Лаба 3
	//fmt.Println("Ньютона -", snau.Newton(func(f float64) float64 { return math.Cos(f) - f*f*f }, 0, 0.001))
}

// Вывод
//0.19634944003810098 3.811902345625858e-09
//0.19634940866640296 2.2137558286505765e-08
//0.19642765260874218 1.3020805412109851e-05
//0.19597239895846208 0.002043287065238123 (различается при запусках из за рандома)
//0.19634891515714303 5.1453733246886735e-05
